# Liberías

In [1]:
import pandas as pd
import zipfile
from bs4 import BeautifulSoup as bs
import requests as req

In [2]:
zip_file_path = '../data/archive.zip'

with zipfile.ZipFile(zip_file_path, 'r') as zip_ref:
    extracted_file = zip_ref.extract('Netflix Userbase.csv')
    netflix = pd.read_csv(extracted_file)

In [3]:
netflix.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 2500 entries, 0 to 2499
Data columns (total 10 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   User ID            2500 non-null   int64
 1   Subscription Type  2500 non-null   object
 2   Monthly Revenue    2500 non-null   int64
 3   Join Date          2500 non-null   object
 4   Last Payment Date  2500 non-null   object
 5   Country            2500 non-null   object
 6   Age                2500 non-null   int64
 7   Gender             2500 non-null   object
 8   Device             2500 non-null   object
 9   Plan Duration      2500 non-null   object
dtypes: int64(3), object(7)
memory usage: 195.4+ KB

In [4]:
netflix.head()

,User ID,Subscription Type,Monthly Revenue,Join Date,Last Payment Date,Country,Age,Gender,Device,Plan Duration
0,1,Basic,10,15-01-22,10-06-23,United States,28,Male,Smartphone,1 Month
1,2,Premium,15,05-09-21,22-06-23,Canada,35,Female,Tablet,1 Month
2,3,Standard,12,28-02-23,27-06-23,United Kingdom,42,Male,Smart TV,1 Month
3,4,Standard,12,10-07-22,26-06-23,Australia,51,Female,Laptop,1 Month
4,5,Basic,10,01-05-23,28-06-23,Germany,33,Male,Smartphone,1 Month

In [5]:
# Nombres columnas:

netflix.columns = [i.lower().strip().replace(' ','_') for i in netflix.columns]

netflix.head()

,user_id,subscription_type,monthly_revenue,join_date,last_payment_date,country,age,gender,device,plan_duration
0,1,Basic,10,15-01-22,10-06-23,United States,28,Male,Smartphone,1 Month
1,2,Premium,15,05-09-21,22-06-23,Canada,35,Female,Tablet,1 Month
2,3,Standard,12,28-02-23,27-06-23,United Kingdom,42,Male,Smart TV,1 Month
3,4,Standard,12,10-07-22,26-06-23,Australia,51,Female,Laptop,1 Month
4,5,Basic,10,01-05-23,28-06-23,Germany,33,Male,Smartphone,1 Month

In [6]:
# Cambiamos el formato de la fecha para ordenarla al revés:

netflix.join_date = [pd.to_datetime(i) for i in netflix.join_date]
netflix.last_payment_date = [pd.to_datetime(i) for i in netflix.last_payment_date]

netflix.head()

,user_id,subscription_type,monthly_revenue,join_date,last_payment_date,country,age,gender,device,plan_duration
0,1,Basic,10,2022-01-15,2023-10-06,United States,28,Male,Smartphone,1 Month
1,2,Premium,15,2021-05-09,2023-06-22,Canada,35,Female,Tablet,1 Month
2,3,Standard,12,2023-02-28,2023-06-27,United Kingdom,42,Male,Smart TV,1 Month
3,4,Standard,12,2022-10-07,2023-06-26,Australia,51,Female,Laptop,1 Month
4,5,Basic,10,2023-01-05,2023-06-28,Germany,33,Male,Smartphone,1 Month

In [7]:
netflix.plan_duration.unique() # Esta columna sobra, el resto están bien

array(['1 Month'], dtype=object)

In [8]:
netflix.drop(columns = 'plan_duration', inplace = True)

netflix.head()

,user_id,subscription_type,monthly_revenue,join_date,last_payment_date,country,age,gender,device
0,1,Basic,10,2022-01-15,2023-10-06,United States,28,Male,Smartphone
1,2,Premium,15,2021-05-09,2023-06-22,Canada,35,Female,Tablet
2,3,Standard,12,2023-02-28,2023-06-27,United Kingdom,42,Male,Smart TV
3,4,Standard,12,2022-10-07,2023-06-26,Australia,51,Female,Laptop
4,5,Basic,10,2023-01-05,2023-06-28,Germany,33,Male,Smartphone

# Puliendo la information: precio de cada suscripción en dólares estadounidenses

La columna de ingresos debería contener la tarifa de suscripción de cada tipo de suscripción. Sin embargo, estos números no tienen unidades y no son muy precisos, por lo que los cambiaré por su precio real en 2023.

In [9]:
netflix.subscription_type.unique() # Hay sólo tres tipos

array(['Basic', 'Premium', 'Standard'], dtype=object)

In [10]:
url = 'https://beebom.com/how-much-netflix-costs-each-country-worldwide/'

soup = bs(req.get(url).content,'html.parser')

rows = soup.find_all('table')[7].find_all('tr')

rows[1]

<tr><td>Afghanistan</td><td class="has-text-align-center" data-align="center"></td><td class="has-text-align-center" data-align="center">$3.99</td><td class="has-text-align-center" data-align="center">$7.99</td><td class="has-text-align-center" data-align="center">$9.99</td></tr>

In [11]:
table = []

for i in rows:
    row = []
    for j in i:
        row.append(j.text)
        
    table.append(row)

table = pd.DataFrame(table)

table.head()

               0       1      2         3        4
0        Country  Mobile  Basic  Standard  Premium
1    Afghanistan          $3.99     $7.99    $9.99
2  Åland Islands          7.99€    11.99€   15.99€
3        Albania          4.99€     7.99€    9.99€
4        Algeria          $3.99     $7.99    $9.99

In [12]:
col_names = list(table.loc[0])

col_names

['Country', 'Mobile', 'Basic', 'Standard', 'Premium']

In [13]:
table.drop(index = 0, inplace = True)
table.reset_index(drop = True, inplace = True)
table.columns = col_names

table.head()

          Country Mobile  Basic Standard Premium
0     Afghanistan         $3.99    $7.99   $9.99
1   Åland Islands         7.99€   11.99€  15.99€
2         Albania         4.99€    7.99€   9.99€
3         Algeria         $3.99    $7.99   $9.99
4  American Samoa         $9.99   $15.49  $19.99

In [14]:
# Pasemos todo a dólares. Veamos qué símbolos tenemos:

table.Premium.unique()

array(['$9.99', '15.99€', '9.99€', '$19.99', '17.99€', '$15.99',
       '1899 ARS', '11.99€', 'AU$22.99', '$15.79', '$18.79', '$7.99',
       '$11.99', '159kr', 'R$55,90', '$13.99', '20.99 CAD', '$10,700 CLP',
       '38,900 COP', 'NZ$24.99', '13.99€', '319,00 Kč', '149kr', '$10.99',
       '165 EGP', '129kr', '£ 15.99', '93 HKD', '4490 Ft', '649 INR',
       '186,000 IDR', '20.99€', '60.90 ILS', '1,980 JPY', '1,100 KES',
       '$14.99', '24,90 CHF', '55 MYR', '$299 MXN', '95 MAD', '4,400 NGN',
       'Rs 1,100', '$12.99', 'PEN 44.90', '549 PHP', '60 PLN', '61 SAR',
       '21.98 SGD', '199 ZAR', '17,000 KRW', '179 kr', '390 TWD',
       '419 THB', '130.99 TRY', '\xa0$9.99', '56 AED', '260,000 VND'],
      dtype=object)

In [15]:
# Sacado de Bard (actualizado a fecha de 11 agosto de 2023):

dictio = {
    '$': 1.0,
    '€': 1.099,
    'ARS': 0.00344,
    'NZ$': 0.602,
    'CAD': 0.786,
    'CLP': 0.00146,
    'COP': 0.000255,
    'AU$': 0.731,
    'kr': 0.117,  # Assuming SEK, NOK, DKK, and ISK
    'R$': 0.189,
    'EGP': 0.0633,
    '£': 1.372,
    'HKD': 0.128,
    'Ft': 0.00304,
    'INR': 0.0134,
    'IDR': 0.000069,
    'ILS': 0.302,
    'JPY': 0.00906,
    'KES': 0.0090,
    'CHF': 1.09,
    'MYR': 0.234,
    'MXN': 0.0496,
    'MAD': 0.111,
    'NGN': 0.00241,
    'PEN': 0.259,
    'PHP': 0.0195,
    'PLN': 0.262,
    'SAR': 0.265,
    'SGD': 0.728,
    'ZAR': 0.0671,
    'KRW': 0.000079,
    'TWD': 0.0356,
    'THB': 0.0299,
    'TRY': 0.115,
    'AED': 0.271,
    'VND': 0.000042,
    'CA$': 0.785
}

In [16]:
def cambio_moneda(x):
    
    res = 0
    a = x.replace(',','.').replace('Rs','$').replace('\xa0$','$')
    for i in dictio.keys():
        if i in a:
            try:
                res = round(float(a.replace(i,'').replace('$','').strip())*dictio[i],2)
            except:
                continue
    return res

In [17]:
# Cambiemos las columnas de precio:

tochange = list(table.columns)[1:]

tochange

['Mobile', 'Basic', 'Standard', 'Premium']

In [18]:
for i in tochange:
    table[i] = table[i].apply(cambio_moneda)
    
table

             Country  Mobile  Basic  Standard  Premium
0        Afghanistan    0.00   3.99      7.99     9.99
1      Åland Islands    0.00   8.78     13.18    17.57
2            Albania    0.00   5.48      8.78    10.98
3            Algeria    0.00   3.99      7.99     9.99
4     American Samoa    0.00   9.99     15.49    19.99
..               ...     ...    ...       ...      ...
239  Wallis & Futuna    2.99   3.99      7.99     9.99
240   Western Sahara    0.00   7.99      9.99    11.99
241            Yemen    0.00   3.99      7.99     9.99
242           Zambia    2.99   3.99      7.99     9.99
243         Zimbabwe    2.99   3.99      7.99     9.99

[244 rows x 5 columns]

In [19]:
# Quitemos la columna de Mobile, que no está contemplada en la otra tabla:

table.drop(columns = 'Mobile', inplace = True)

table.head()

          Country  Basic  Standard  Premium
0     Afghanistan   3.99      7.99     9.99
1   Åland Islands   8.78     13.18    17.57
2         Albania   5.48      8.78    10.98
3         Algeria   3.99      7.99     9.99
4  American Samoa   9.99     15.49    19.99

In [20]:
countries = netflix.country.unique() # Países de nuestra tabla de Netflix

countries

array(['United States', 'Canada', 'United Kingdom', 'Australia',
       'Germany', 'France', 'Brazil', 'Mexico', 'Spain', 'Italy'],
      dtype=object)

In [21]:
exists = [i in list(table.Country) for i in countries]

exists # Están todos los países, y con el mismo nombre aparentemente.

[True, True, True, True, True, True, True, True, True, True]

In [22]:
# Añadamos la columna:

netflix['subscription_price'] = [table[table.Country == netflix.loc[i]['country']][netflix.loc[i]['subscription_type']].iloc[0] \
                                 for i in range(netflix.shape[0])]
# Nos deshacemos de la otra:

netflix.drop(columns = 'monthly_revenue', inplace = True)

netflix.head()

,user_id,subscription_type,join_date,last_payment_date,country,age,gender,device,subscription_price
0,1,Basic,2022-01-15,2023-10-06,United States,28,Male,Smartphone,9.99
1,2,Premium,2021-05-09,2023-06-22,Canada,35,Female,Tablet,16.50
2,3,Standard,2023-02-28,2023-06-27,United Kingdom,42,Male,Smart TV,15.08
3,4,Standard,2022-10-07,2023-06-26,Australia,51,Female,Laptop,12.42
4,5,Basic,2023-01-05,2023-06-28,Germany,33,Male,Smartphone,8.78

# Expandiendo la información: salario mínimo interprofesional

Sería interesante conocer el salario en dólares en cada país, para poder comparar los precios de Netflix entre ellos de forma relativa. Scrapeamos una página más.

In [23]:
url = 'https://datosmacro.expansion.com/smi'

soup = bs(req.get(url).content,'html.parser')

tabla = soup.find('table',id = 'tb1')

filas = tabla.find_all('tr')

filas[1]

<tr><td><a href="/smi/espana" title="España - Salario Mínimo ">España [+]</a></td><td class="fecha" data-value="2023-06-01">2023</td><td class="numero" data-value="1260">1.260,0</td><td><span title="Euros">€</span></td><td class="numero dol" data-value="1346.1">1.346,1 $</td><td class="numero eur" data-value="1260">1.260,0 €</td><td class="hbar eur wdsp1_2"><div class="graph_hbar" style="background-color: #F1BF00; width:32.3%;" title="1.260,0 €"></div></td><td class="numero" data-value="0">0</td></tr>

In [24]:
table = []

for i in filas:
    filas = []
    for j in i:
        filas.append(j.text)
        
    table.append(filas)

table = pd.DataFrame(table)[[0,2,3]]

table.head()

                 0               2    3
0           Países  SMI Mon. Local  SMI
1       España [+]         1.260,0    €
2     Alemania [+]         1.997,0    €
3  Reino Unido [+]         1.621,1    £
4      Francia [+]         1.747,2    €

In [25]:
table.columns = ['country','SMI','coin']
table.drop(index = 0, inplace = True)
table.country = [i.replace('[+]','').strip() for i in table.country]

table.head()

       country      SMI coin
1       España  1.260,0    €
2     Alemania  1.997,0    €
3  Reino Unido  1.621,1    £
4      Francia  1.747,2    €
5     Portugal    886,7    €

In [26]:
# Quedémonos solo con los países que nos interesan esta vez, sin liarla tanto

netflix.country.unique()

array(['United States', 'Canada', 'United Kingdom', 'Australia',
       'Germany', 'France', 'Brazil', 'Mexico', 'Spain', 'Italy'],
      dtype=object)

In [27]:
# Nombres en español para buscarlos:

esp = ['Estados Unidos','Canadá','Reino Unido','Australia','Alemania',
       'Francia','Brasil','México','España','Italia']

In [28]:
filtro = [i in esp for i in table.country]

table = table[filtro]

table

            country      SMI coin
1            España  1.260,0    €
2          Alemania  1.997,0    €
3       Reino Unido  1.621,1    £
4           Francia  1.747,2    €
6    Estados Unidos  1.256,7    $
16        Australia  3.434,6    $
28           Brasil  1.212,0   R$
34           Canadá  2.528,9    $
113          México  5.258,1    $

In [29]:
# Falta Italia, que no tiene. Cambiamos nombres a inglés:

table.country = ['Spain','Germany','United Kingdom','France',
                 'United States','Australia','Brazil','Canada','Mexico']

table = table.append({'country' : 'Italy' , 'SMI' : '0', 'coin' : '€'} , ignore_index = True)

/tmp/ipykernel_37349/4031683119.py:6: FutureWarning: The frame.append method is deprecated and will be removed from pandas in a future version. Use pandas.concat instead.
  table = table.append({'country' : 'Italy' , 'SMI' : '0', 'coin' : '€'} , ignore_index = True)

In [30]:
# Cambiemos las monedas que tienen el nombre genérico por el símbolo de 'dictio' adecuado:

table.iloc[7,2] = 'CA$'
table.iloc[8,2] = 'MXN'
table.iloc[5,2] = 'AU$'

table

          country      SMI coin
0           Spain  1.260,0    €
1         Germany  1.997,0    €
2  United Kingdom  1.621,1    £
3          France  1.747,2    €
4   United States  1.256,7    $
5       Australia  3.434,6  AU$
6          Brazil  1.212,0   R$
7          Canada  2.528,9  CA$
8          Mexico  5.258,1  MXN
9           Italy        0    €

In [31]:
# Cambiamos de moneda a dólares estadounidenses y de formato de número:

table.SMI = [float(i.replace('.','').replace(',','.')) for i in table.SMI]

table.SMI = [round(table.iloc[i,1]*dictio[table.iloc[i,2]],2) for i in range(table.shape[0])]

table.coin = '$'

table

          country      SMI coin
0           Spain  1384.74    $
1         Germany  2194.70    $
2  United Kingdom  2224.15    $
3          France  1920.17    $
4   United States  1256.70    $
5       Australia  2510.69    $
6          Brazil   229.07    $
7          Canada  1985.19    $
8          Mexico   260.80    $
9           Italy     0.00    $

In [32]:
# Hagamos el cambio de divisa.

netflix['IMS'] = [table[table.country == netflix.loc[i]['country']]['SMI'].iloc[0] for i in range(netflix.shape[0])]

netflix.loc[netflix.country == 'Italy','IMS'] = None # Asignamos none a Italia, que no hay IMS en ese país

netflix.head(10)

,user_id,subscription_type,join_date,last_payment_date,country,age,gender,device,subscription_price,IMS
0,1,Basic,2022-01-15,2023-10-06,United States,28,Male,Smartphone,9.99,1256.70
1,2,Premium,2021-05-09,2023-06-22,Canada,35,Female,Tablet,16.50,1985.19
2,3,Standard,2023-02-28,2023-06-27,United Kingdom,42,Male,Smart TV,15.08,2224.15
3,4,Standard,2022-10-07,2023-06-26,Australia,51,Female,Laptop,12.42,2510.69
4,5,Basic,2023-01-05,2023-06-28,Germany,33,Male,Smartphone,8.78,2194.70
5,6,Premium,2022-03-18,2023-06-27,France,29,Female,Smart TV,19.77,1920.17
6,7,Standard,2021-09-12,2023-06-25,Brazil,46,Male,Tablet,7.54,229.07
7,8,Basic,2023-02-04,2023-06-24,Mexico,39,Female,Laptop,6.89,260.80
8,9,Standard,2022-10-20,2023-06-23,Spain,37,Male,Smartphone,14.28,1384.74
9,10,Premium,2023-07-01,2023-06-22,Italy,44,Female,Smart TV,19.77,NaN

# Guardado en csv

Ahora que ya tenemos todo listo, guardamos la tabla en un csv para que sea accesible desde Tableau o Power BI.

In [33]:
# Para tableau, vamos a cambiar los puntos de los campos decimales por comas 
# y dejar esas columnas en formato string:

netflix.subscription_price = netflix.subscription_price.apply(lambda x: str(x).replace('.',','))
netflix.IMS = netflix.IMS.apply(lambda x: str(x).replace('.',','))

netflix.head()

,user_id,subscription_type,join_date,last_payment_date,country,age,gender,device,subscription_price,IMS
0,1,Basic,2022-01-15,2023-10-06,United States,28,Male,Smartphone,"9,99","1256,7"
1,2,Premium,2021-05-09,2023-06-22,Canada,35,Female,Tablet,"16,5","1985,19"
2,3,Standard,2023-02-28,2023-06-27,United Kingdom,42,Male,Smart TV,"15,08","2224,15"
3,4,Standard,2022-10-07,2023-06-26,Australia,51,Female,Laptop,"12,42","2510,69"
4,5,Basic,2023-01-05,2023-06-28,Germany,33,Male,Smartphone,"8,78","2194,7"

In [34]:
netflix.to_csv('../data/netflix_clean.csv')